import constants as c

DATA = {
    "img_path": "yasiki_out.png",
    "spawn_pos": [400, 450],
    "collision": [
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0],
        [1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0],
        [1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1],
    ],
    "exits": [
        {"rect": (0, 560, 800, 40), "target": "forest"},
    ],
    "objects": [
        {
            "name": "屋敷の扉",
            "char_id": None,
            "rect": (380, 180, 100, 100),  # 屋敷の入り口の座標に合わせて調整してください
            "target_scene": "door_locked"
        },
        {
            "name": "ジョン",
            "char_id": "john",  # これを追加
            "rect": (250, 314, 50, 80),
            "target_scene": "npc_guard"
        },
        {
            "name": "アンナ",
            "char_id": "anna",  # これを追加
            "rect": (316, 214, 50, 80),
            "target_scene": "npc_anna",
            "direction": 2  # 0:下, 1:左, 2:右, 3:上
        },
        {
            "name": "モニカ",
            "char_id": "monika",  # これを追加
            "rect": (350, 200, 50, 80),
        },
        {
            "name": "花",
            "rect": (530, 310, 50, 50),
            "target_scene": "mansion_flower"
        }

    ]
}
