import constants as c

DATA = {
    "img_path": "yasiki.png",
    "spawn_pos": [400, 430],
    "collision": [
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1],
        [1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1],
        [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1],
    ],
    "exits": [
        {"rect": (60, 330, 100, 100), "target": "monooki"},
        {"rect": (660, 320, 100, 100), "target": "syokutaku"},
        {"rect": (0, 560, 800, 40), "target": "mansion_out"},
        {"rect": (600, 0, 200, 200), "target": "piano_room"},
        {"rect": (0, 0, 200, 200), "target": "sinsitu"}

    ],
    "objects": [
        {
            "name": "家の中のアンナ",
            "rect": (52, 398, 100, 64),
            "target_scene": "anna_inside",  # 調べた時に飛ぶシーン名
            "direction": 1,  # 0:下, 1:左, 2:右, 3:上
        },
        {
            "name": "家の中のモニカ",
            "rect": (228, 318, 100, 64),
            "target_scene": "monika_inside",  # 調べた時に飛ぶシーン名
            "direction": 3,  # 0:下, 1:左, 2:右, 3:上
        },
        {
            "name": "家の中のジョン",
            "rect": (376, 62, 100, 64),
            "target_scene": "john_inside",  # 調べた時に飛ぶシーン名
            "direction": 0,  # 0:下, 1:左, 2:右, 3:上
        }
    ]
}
